jmeter-scripts/zeninf.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">5</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value"> Bearer eyJhbGciOiJSUzI1NiIsImNhdCI6ImNsX0I3ZDRQRDIyMkFBQSIsImtpZCI6Imluc18yYkxnMEJaWmg4empwMTAxdXVkWldRZGl2d28iLCJ0eXAiOiJKV1QifQ.eyJhenAiOiJodHRwczovL3N0YWdpbmcuemVuaW5ib3guYWkiLCJleHAiOjE3NDUzOTY2MDIsImV4dGVybmFsSWQiOiI4MSIsImV4dGVybmFsTWVtYmVyc2hpcElkIjo1OTUsImV4dGVybmFsT3Jnbml6YXRpb25JZCI6MjU2MiwiaWF0IjoxNzM1Mzk2NjAzLCJpZFByb3BzIjp7ImVtYWlsIjoiYW5hY29vb25kYUBvdXRsb29rLmNvIiwiZmlyc3ROYW1lIjoiRWxpc2hhIiwibGFzdE5hbWUiOiJTYWxnYWRvIiwib3JnIjoibHRtdGVyIn0sImlzcyI6Imh0dHBzOi8vdGVhY2hpbmctYmF0LTYwLmNsZXJrLmFjY291bnRzLmRldiIsImp0aSI6IjQ3YTZiZDFiYWQwOWI1OWE4MTUyIiwibmJmIjoxNzM1Mzk2NTk4LCJvcmduaXphdGlvbklkIjoib3JnXzJxcWlUWXhlWGZGaWZyQ2VNSDdXZzJaT3hMOSIsInJvbGUiOiJvcmc6YWRtaW4iLCJzdWIiOiJ1c2VyXzJpZGtKU2NadWtSaG5sTGpxaHNvbEN4bEdVNyJ9.Rh35eg7MmvpJTZXZrIOtu3DLZXurTHRc8aAMYTD2tEd1PAQvkGK004Yqx8A3x62YhyP2amhLNM04OC-ey-fzZJAD3NyUnolYQfXEbx5JUibHnuCr_a5ka0fWj0iRFGgIMZgbZlq4Qg3wTXa8dP-h8u3zzNm34mUpcSkSNSXXbdgOWuoiJ4BGmXgcIuipFqFZc4awVNC0-NqtszWw5831uLMnPy_jyzEEuUHHmX3M02KxAYhQ_BwNKII7p03T7iP75J2NYUOLAP8fyuuTX5NggNctoBoEtz9jeoMw1vTXRFQgzy_5j3iPqUzdQm-01000VI2hv4_VPXyaAWFuxgc52Q</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json , text/plain, */*</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Origin</stringProp>
              <stringProp name="Header.value">https://staging.zeninbox.ai</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Referer</stringProp>
              <stringProp name="Header.value">https://staging.zeninbox.ai/</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;workspaceName&quot;:&quot;dfg&quot;,&quot;description&quot;:&quot;sdf&quot;,&quot;selectedTimezone&quot;:&quot;GMT +5:30&quot;,&quot;parentId&quot;:2562,&quot;selectedMembers&quot;:[&quot;user_2idkJScZukRhnlLjqhsolCxlGU7&quot;]}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">api.staging.zeninbox.ai</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/company/workspaces</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>